{
  "adversarial-minesweeper": "The board updates adversarially to punish guessing and ensure only logically safe moves are rewarded. This version of Minesweeper uses constraint satisfaction and backtracking to place mines only when consistent with all revealed information—so every mistake is your fault.",
  "anu-timetable": "All times are shown in the timezone of your device, and links to your timetable can be shared at will. The timetable supports selecting tutorials, workshops, and labs. It also has Google Maps links for directions to each location displayed. Notes can be stored for each activity by clicking on it in the calendar. Each upcoming activity is displayed below the calendar with the time until its commencement.",
  "better-genesis": "BetterGenesis is used by hundreds of students at my high school to track their grades with grade calculators and trend tracking. I facetiously named it BetterGenesis after the school's crude grade viewing system, Genesis. The backend consists of an Express web server with industry standard AES-256 encryption, and the frontend is made in <a href=\"https://vuejs.org\" target=\"_blank\">Vue.js</a> with <a href=\"https://vuetifyjs.com/en/\" target=\"_blank\">Vuetify</a>.",
  "chess-memory": "Inspired by Human Benchmark's <a href=\"https://humanbenchmark.com/tests/memory\" target=\"_blank\">Visual Memory Test</a>, ChessMemory trains both visual memory and chess tactics at the same time. ChessMemory uses puzzles from the <a href=\"https://lichess.org\" target=\"_blank\">lichess.org</a> puzzle database. The website is also featured on <a href=\"https://database.lichess.org/#related-projects\" target=\"_blank\">https://database.lichess.org/#related-projects</a>.",
  "cstimer-rp": "This program provides Discord Integration for the popular Rubik's Cube timer <a href=\"https://cstimer.net\">csTimer.net</a>. The program consists of <a href=\"https://jquery.com\" target=\"_blank\">jQuery</a> code which runs through a Chrome extension and a Python program that uses <a href=\"https://discordpy.readthedocs.io/en/stable/\" target=\"_blank\">discord.py</a>. Updating every 5 seconds, the program shows the average of the user's past 5 and 12 solve times as well as the event and scramble type.",
  "digit-classifier": "This is a simple PyTorch implementation of a neural network for recognizing black-and-white images of handwritten digits using the MNIST dataset. The model achieves an accuracy of 98.44% on the test set. The model runs in the browser via ONNX.js. The UI code was adapted from <a href=\"https://github.com/elliotwaite\" target=\"_blank\">Elliot Waite</a>.",
  "Melat-8®": "Melat-8 is a website I build as an intern for <a href=\"https://www.pharmvista.com\" target=\"_blank\">Pharmvista</a>. The site features their line of organic melatonin gummies in a theme similar to the <a href=\"https://apple.com\" target=\"_blank\">Apple</a> website. I built this project using <a href=\"https://getbootstrap.com\">Bootstrap</a> and a healthy dose of teamwork, communication, and meeting deadlines.",
  "overleaf-dark-mode": "The extension inverts colours in the editor, PDF viewer, and modals, and adds a dark background to most content panes. It may be toggled by clicking on the icon.",
  "rhythm": "Rhythm was one of my first ventures into Java. Notes fall in time to each track, and the player must tap the corresponding keys. I used the AWT for visuals and JLayer for audio.<div align=\"center\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OSIjwNaCi-o?si=heOCM58drOLJI3qj\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>",
  "seam-carving": "It uses an energy function and dynamic programming to intelligently remove low-importance pixel seams. This allows images to be resized while preserving key features, avoiding distortion or cropping.",
  "sentiment-analysis": "This sentiment analysis model is built with PyTorch and trained on a dataset of Amazon product reviews. The model predicts sentiment on a scale from -1 (completely negative) to 1 (completely positive). The dataset used is the <a href=\"https://www.kaggle.com/datasets/pradeeshprabhakar/preprocessed-dataset-sentiment-analysis\" target=\"_blank\">Preprocessed Dataset for Sentiment Analysis</a> from <a href=\"https://kaggle.com\" target=\"_blank\">Kaggle</a>.",
  "trump-tweet-generator": "It consists of a transformer-based model (similar to GPT) trained on Donald Trump's tweets. The model architecture consists of multi-head self-attention layers and feed-forward neural networks. The dataset used is the <a href=\"https://www.kaggle.com/datasets/kingburrito666/better-donald-trump-tweets/data\" target=\"_blank\">(Better) - Donald Trump Tweets!</a> from <a href=\"https://kaggle.com\" target=\"_blank\">Kaggle</a>.",
  "universal-ranks": "UniversalRanks is a system that ranks all-round chess ability by averaging a player's rating across classical, rapid, and blitz formats—each normalized as a percentage of the highest rating in that format. Inspired by KinchRanks (used in speedcubing), it rewards rating gains even without changes in rank and emphasizes progress at the top level. Ratings are sourced live from <a href=\"https://2700chess.com\" target=\"_blank\">2700chess.com</a> and exclude inactive classical players.",
  "wordle-ai": "The AI can guess the WORDLE in an average of 3.42 turns, which was shown by <a href=\"http://sonorouschocolate.com/notes/index.php?title=The_best_strategies_for_Wordle\" target=\"_blank\">Alex Selby</a> to be optimal. The AI tries first to maximize the number of unique tile colorings that can be given for a guess, and second to minimize the variance of the number of possibilities that could remain after making the guess.",
  "zpordle-ai": "If \\(d\\) is the \\(p\\)-adic distance after guessing a number \\(g\\), the AI guesses the smallest number of the remaining possibilities that is of the form \\(g + k/d\\) for some integer \\(k\\) such that \\(p\\) does not divide \\(k\\)."
}
